class LearnQuestions {
  // key is a question and value is an answer
  static Map<String, String> getQuestionsAndAnswers = {
    "لقد نسيتُ كلمة المرور، كيف يمكنني تسجيل الدخول؟": '''
    إذا كنت قد نسيت كلمة مرور تعلم الخاصّة بك، أو لا يمكنك تسجيل الدخول إلى حسابك، يمكنك إعادة تعيين كلمة مرور جديدة باتباع هذه الخطوات:

    ١. افتح صفحة إعادة تعيين كلمة المرور

٢. أدخل عنوان البريد الإلكتروني المسجّل في حسابك، وانقر على "إعادة تعيين كلمة المرور"؛

سيتم بعد ذلك إرسال رابط لإعادة تعيين كلمة المرور الخاصة بك إلى البريد الإلكتروني المسجّل في حسابك. 

إذا لم تتلق البريد الإلكتروني لإعادة التعيين، فيرجى التحقق من مجلد البريد غير الهام أو البريد العشوائي. 
إذا كنت قد جربت الخطوات المذكورة أعلاه، وما زلت لا تستطيع إعادة تعيين كلمة المرور الخاصة بك، فسيكون فريق الدعم لدينا سعيدًا لمساعدتك، يرجى إرسال نموذج طلب فورًا. ويرجى الحرص على عدم تضمين أي كلمات مرور في نموذج الطلب الخاص بك. 
أين أجد الايميلات المرسلة من تعلم؟

قم بالتحقق من البريد المزعج للتأكد من عدم وصول الرسائل إلى هناك عن طريق الخطأ! تأكد من أنّ عنوان بريدك الالكتروني محدث في صفحة حسابك. يمكنك أيضًا إضافة بريدنا help@learn.com إلى "جهات الاتصال" الخاص بك للتأكد من استلام رسائلنا!
    ''',
    "هل يمكنني استخدام أي جهاز لتعلم؟":
        '''الخبر السار، أنه يمكنك استخدام أي جهاز تقريبًا للاتصال بمعلمينا في تعلم. 

تعلم يدعم أجهزة الآيفون والآيباد وهواتف الاندرويد وأجهزة الكمبيوتر التي تعمل بنظام ويندوز وماك.

نوصي باستخدام متصفح قوقل كروم Google Chrome أو مايكروسوفت Edge لمستخدمي الويب. 

إذا كنت تستخدم جهاز آيفون وآيباد، فيمكنك تنزيل أحدث نسخة لتطبيق تعلم/ learn من متجر تطبيقات آبل. 

وإذا كنت تستخدم جهاز اندرويد فيمكنك تنزيل أحدث نسخة لتطبيق تعلم/ learn من متجر تطبيقات اندرويد.
    ''',
    "هل يمكنني حذف حسابي؟":
        ''' يمكنك تقديم طلب حذف حساب من صفحة اعدادات الحساب . 
انقر الزر "حذف الحساب" لبدء عملية حذف حسابك وجميع معلوماتك الشخصية بشكل دائم. 
يجب أن تكون قادرًا على تسجيل الدخول إلى حسابك لطلب الحذف.  


كيف يمكنني إلغاء الاشتراك في رسائل البريد الإلكتروني من تعلم/learn؟
نأسف لسماع أنّك لم تعد ترغب في تلقي رسائل البريد الإلكتروني والعروض الترويجية من تعلم/learn . لكننا نتفهم ونحترم قرارك.

هناك طريقتان سهلتان لإلغاء الاشتراك من رسائل البريد الإلكتروني.

توقف لحظة للعثور على أي بريد إلكتروني من تعلم/learn
 انقر على "إلغاء الاشتراك من جميع رسائل البريد الإلكتروني"
  في الجزء السفلي من البريد الإلكتروني. سيتم نقلك إلى صفحة إلغاء الاشتراك من البريد الإلكتروني. هناك يمكنك النقر على "ألغِ اشتراكي" لإلغاء الاشتراك تمامًا من رسائل البريد الإلكتروني لتعلم/learn.  
يمكنك إلغاء الاشتراك في رسائل البريد الإلكتروني لتعلم/learn عن طريق تحديث تفضيلات أو اعدادات البريد الإلكتروني الخاصة بك.  يمكنك الانتقال إلى صفحة تفضيلات البريد الإلكتروني الخاصة بك عن طريق تسجيل الدخول إلى حسابك والنقر على القائمة الرئيسية.
    '''
  };
}
