Repository: Zribi-Ali/learnApp
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Terms And Conditions
ar: الاحكام و الشروط

source: Privacy Policy
ar: سياسة الخصوصية

source: About US
ar: من نحن

source: Contact US
ar: من نحن

source: Masdar Training
ar: مصدر للتدريب

# streamToday
source: Stream today at
ar: بث مباشر اليوم في

# operationSuccess
source: This operation was successful
ar: لقد تمت العملية بنجاح

# noDiscussion
source: No discussion found
ar: لم يتم العثور على أي محادثة

# cardInfo
source: Enter your card information
ar: ادخل بيانات بطاقتك

source: Delete user
ar: حذف مستخدم

# accountDeleted
source: Your account has been successfully deleted
ar: تم حذف حسابك بنجاح

# noStudentsForStream
source: No one is watching
ar: لا أحد يشاهد هذا البث

# updatedSuccess
source: your account has been updated successfully
ar: تم تحديث حسابك بنجاح

# addReviewSuccess
source: Your review has been added
ar: لقد تمت اضافة التقييم بنجاح

# addReviewError
source: Please write a review
ar: الرجاء كتابة التقييم

source: Add review
ar: اضافة تقييم

# writeReply
source: Write a reply
ar: اكتب رد

source: Subject
ar: موضوع

source: Subject description
ar: وصف الموضوع

source: No comments
ar: لا توجد تعليقات متاحة

# courseAdded
source: This course has been added
ar: تم إضافة الدورة

# noVideos
source: No video available
ar: لا توجد مقاطع فيديو متاحة

# chooseRating
source: Choose your rating
ar: قم باختيار التقييم

source: Add comment
ar: اضافة تعليق

source: Teacher
ar: المدرس

# noModifications
source: No modifications are found
ar: لم يتم العثور على أي تعديلات

# failedOperation
source: Unexpected Server error occurred, your operation failed
ar: حدث خطأ غير متوقع في الخادم ، فشلت عملية التعديل

# noFiles
source: No Files available
ar: لا توجد ملفات متاحة

# noStreams
source: No streams are available
ar: لا يوجد بث مباشر متاح لهذا الوقت

source: Live Streaming
ar: البث المباشر

source: Live now
ar: البث الحالي

# liveUpcoming
source: Upcoming live
ar: البث القادم

# liveDone
source: Past live
ar: البث القديم

source: Download
ar: تحميل

source: Reviews
ar: التقييمات

source: Comments
ar: تعليقات

source: Resume
ar: ملخص

# noCityError
source: Please Choose a city
ar: الرجاء اختيار مدينة

# failedSignUp
source: Unexpected Server error occurred, your sign up failed
ar: حدث خطأ غير متوقع في الخادم ، فشلت عملية التسجيل

# noUser
source: User is not found
ar: المستخدم غير موجود

# noCourses
source: There are no courses available
ar: لا توجد دورات متاحة

# noCoursesForLang
source: There are no courses available for this language
ar: لا توجد دورات متاحة لهذه اللغة

# noUnitsForCourse
source: There are no available units for this course
ar: لا توجد وحدات متاحة لهذه الدورة

# unRead1
source: You have
ar: لديك

# unRead2
source: unread messages
ar: رسائل غير مقروءة

source: Chat
ar: المحادثات

# onlineMeeting
source: Join online meeting
ar: الانضمام للقاء على الانترنت

source: Units
ar: الوحدات

# chooseUnit
source: Please choose a unit
ar: الرجاء اختيار وحدة

# changePasswordMessage
source: Please change your password
ar: الرجاء تغيير كلمة المرور

# incorrectPin
source: incorrect code please try again
ar: رمز غير صحيح، يرجى المحاولة مرة أخرى

source: Verification
ar: تَحَقّق

source: Verify
ar: تحقق

# participateCourse
source: Participate in this course
ar: اشترك في هذه الدورة

# forgetPasswordMessage1
source: You're going to receive a recovery code via email please change your password
ar: سوف يصلك كود التفعيل على الايميل يرجى تغيير كلمة المرور

# codeMessage1
source: I still haven't received the code
ar: لم يصلني الكود بعد

source: Resend
ar: اعادة ارسال

# forgetPasswordMessage
source: Please enter your email address to continue this procedure
ar: الرجاء إدخال بريدك الإلكتروني لمواصلة هذا الإجراء

source: Language
ar: اللغة

source: Log in
ar: تسجيل الدخول

# userName
source: User id
ar: معرف المستخدم

source: Password
ar: كلمة المرور

# passwordError
source: Please enter your password
ar: الرجاء إدخال كلمة مرور

# confirmPassword
source: Confirm your password
ar: تاكيد كلمة المرور

# confirmPasswordError
source: please enter the same password
ar: الرجاء التثبت من كلمة المرور

# forgetPassword
source: Forgot your password
ar: نسيت كلمة المرور

# recoverPassword
source: Recover your password
ar: استرجاع كلمة المرور

# newAccount
source: Create new account
ar: تسجيل حساب جديد

source: Sign up
ar: تسجيل حساب

# userNameErrorMessage
source: Please enter a user id
ar: الرجاء إدخال اسم مستخدم

# email
source: Email Address
ar: البريد الالكتروني

# emailError1
source: Please enter your email address
ar: الرجاء إدخال البريد الالكتروني

# emailError2
source: Plese check your email format
ar: الرجاء التثبت من البريد الالكتروني

# agreeConditions
source: I agree to these terms
ar: اوافق على شروط الاستخدام

# agreeConditionsError
source: Please agree to our terms
ar: الرجاء الموافقة على شروط الاستخدام

# alreadyUser
source: I already have an account
ar: لديك حساب بالفعل

# city
source: Your City
ar: مدينة

source: Change language
ar: تغيير اللغة

source: English
ar: اللغة الانجليزية

source: French
ar: اللغة الفرنسية

source: Spanish
ar: اللغة الاسبانية

source: Chinese
ar: اللغة الصينية

source: Turkish
ar: اللغة التركية

source: Korean
ar: اللغة الكورية

source: German
ar: اللغة الالمانية

source: Arabic
ar: اللغة العربية

# tests
source: Training for the TOEFL and IELTS tests
ar: التدريب لاختبار التوفل و الايلتس

# back
source: Go back
ar: عودة

# viewReplies
source: Replies
ar: عرض الردود

source: Main page
ar: الرئيسية

source: My page
ar: صفحتي

source: Notification
ar: الإشعارات

source: My lessons
ar: دروسي

source: Profile
ar: الملف الشخصي

source: Loading
ar: جار التحميل

# registrationDate
source: Registered on
ar: تم التسجيل بتاريخ

source: Modify Profile
ar: تعديل الملف الشخصي

# activateNotifications
source: Turn notifications on
ar: تفعيل التنبيهات

# terms
source: Terms of use
ar: شروط الاستخدام

# askedQuestions
source: Frequently asked questions
ar: الاسالة الشائعة

source: Write us
ar: راسلنا

source: Events
ar: فعاليات

# addPhoneNumber
source: Add your phone number
ar: اضافة رقم الهاتف

source: Exit
ar: خروج

# notificationTileText
source: A new english lesson has been added
ar: تم اضافة درس انجليزي جديد اليوم

# notificationTileRemove
source: Are you sure you want to delete this notification
ar: هل تريد حذف التنبيه التالي

source: Cancel
ar: الغاء

source: Remove
ar: حذف

source: Done
ar: منتهي

# lessons
source: Lessons of
ar: دروس

source: Minute
ar: دقيقة

# progress
source: In progress
ar: جاري التعليم

# newId
source: New
ar: جديد

# save
source: Save change
ar: حفظ

source: Question
ar: سؤال

source: Message content
ar: محتوى الرسالة

source: Message
ar: الرسالة

source: Or
ar: أو

source: WhatsApp
ar: واتس اب

source: Phone
ar: تلفون

source: Send
ar: ارسل

source: Phone number
ar: رقم الهاتف

# phoneNumberError
source: Please add your phone number
ar: الرجاء اضافة رقم الهاتف

# methodLearning
source: Learning method
ar: طريقة التعلم

# methodLearningFavorite
source: Please choose your preferred Learning method
ar: برجاء اختيار الطريقة المقضلة للتعلم

# method1
source: Systematic education
ar: تعليم منهجي

# method2
source: Independent courses
ar: دورات مستقلة

# chooseGrade
source: Plese select your level of education
ar: برجاء اختيار مرحلتك المدرسية

# classes
source: Available classes
ar: اختيار الصف

# chooseClass
source: Please select your class
ar: برجاء اختيار الصف

# coursesAvailable
source: Systematic courses
ar: الدورات المنهجية المتوفرة

source: Courses
ar: دورات

source: Independent courses
ar: الدورات المستقلة المتوفرة

# chooseCourse
source: Please select your course
ar: برجاء اختيار الدورة

source: Recorded lessons
ar: دروس مسجلة

# recordedCouses
source: Recorded courses
ar: دورات مسجلة

# recordedLessonsMessage
source: Learning from recorded videos
ar: تعليم من خلال فيديوهات مسجلة

source: Live learning
ar: تعليم مباشر

# liveLearningMessage
source: Live learning with a language coach
ar: تعليم مباشرة مع مدرب لغة

# records
source: Payment records
ar: سجلات الدفع

source: Order number
ar: الطلب رقم

# payment
source: electronic payment
ar: الدفع
